#+TITLE: Kokia Assemble/Annotation
#+AUTHOR: Tony Arick
#+TODO: BAD TODO | GOOD QUEUE DONE SKIP
#+DRAWERS: HIDDEN
#+OPTIONS: d:RESULTS 
#+STARTUP: hideblocks align

#+PROPERTY:  header-args :exports results :eval never-export
#+OPTIONS: ^:nil 

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+NAME: plotQuality
#+HEADER: :var fwd="" :var rev=""
#+BEGIN_SRC R  :results output graphics :width 1024 :height 600
  library(ShortRead)
  library(ggplot2)
  library(reshape2)

  reads <- list('Forward'  = as.character(fwd),
                'Reverse' = as.character(rev))
  qaSum <- lapply(reads, qa)
  perCycleQual <- lapply(qaSum, function(x) x[["perCycle"]]$quality)

  ## quant <- lapply(perCycleQual, function(perCycleQual) {
  ##                     rbind(melt(t(sapply(by(list(perCycleQual$Score, perCycleQual$Count), perCycleQual$Cycle,
  ##                                            function(x) quantile(Rle(x[[1]], x[[2]]), c(0.25, 0.5, 0.75))), unlist))),
  ##                           data.frame(Var1=unique(perCycleQual$Cycle), Var2='Mean',
  ##                                      value=rowsum(perCycleQual$Score * perCycleQual$Count, perCycleQual$Cycle)/
  ##                                          rowsum(perCycleQual$Count, perCycleQual$Cycle)))
  ##                 })
** Summary
#+BEGIN_SRC sh :results raw
echo "|Library|Raw|Paired|Forward|Reverse|Dropped|"
echo "|--"
find trim -name '*.log' | xargs grep 'Input Read Pairs' | sed -e 's#.*/#\|#' -e 's/\.log:[^:]*: /\|/' -e 's/ [^:)0-9]*: /\|/g'
#+END_SRC

#+RESULTS:
| Library            |       Raw | Paired             | Forward          | Reverse         | Dropped          |
|--------------------+-----------+--------------------+------------------+-----------------+------------------|
| DL11b.miseq.150501 |   4898277 | 3026355 (61.78%)   | 1069141 (21.83%) | 143027 (2.92%)  | 659754 (13.47%)  |
| DL11b.miseq.150505 |  13042878 | 6816961 (52.27%)   | 3073533 (23.56%) | 529457 (4.06%)  | 2622927 (20.11%) |
| DL11a.hiseq        | 130983519 | 107260737 (81.89%) | 9977566 (7.62%)  | 6511844 (4.97%) | 7233372 (5.52%)  |
| DL11b.hiseq        |  48127768 | 35377873 (73.51%)  | 7093947 (14.74%) | 1989253 (4.13%) | 3666695 (7.62%)  |
| DL11a.miseq.150501 |  14491831 | 9122720 (62.95%)   | 3269076 (22.56%) | 460472 (3.18%)  | 1639563 (11.31%) |
| DL11a.miseq.150505 |   7754973 | 4348676 (56.08%)   | 1773193 (22.87%) | 368852 (4.76%)  | 1264252 (16.30%) |
|--------------------+-----------+--------------------+------------------+-----------------+------------------|
| total              | 219299246 | 165953322          | 26256456         | 10002905        | 17086563         |

*** Genome filtering
#+HEADER: :shebang #!/bin/bash :tangle filter.sh :mkdirp yes
#+BEGIN_SRC sh :var genomes=genome_paths :var minimum_length=minimum_length :var DIR=(file-name-directory buffer-file-name) :results output verbatim
  while read -a lib; do 
    echo $lib
    OUT_PATH=$(dirname ${lib[1]})
    awk 'BEGIN {count=1} /^>/ {print ">SEQ_"count; count++} !/^>/ {print}' $DIR/${lib[1]} > $OUT_PATH/${lib[0]}.renamed.fa
    echo "/home/maa146/bin/fasta_filter.pl $OUT_PATH/${lib[0]}.renamed.fa -length=$minimum_length > $OUT_PATH/${lib[0]}.filtered.fa" | sh
    #rm $OUT_PATH/${lib[0]}.renamed.fa
    ls -lh $OUT_PATH/${lib[0]}.filtered.fa
  done <<< "$genomes";
#+END_SRC

#+RESULTS:
: kirkii
: -rw-r----- 1 thrash igbb 512M Jun  9 13:30 db/kirkii.filtered.fa

**** make SNAP
#+COMMENT: BUSCO to SNAP
#+HEADER: :shebang #!/bin/bash :tangle analysis/annotation/busco/busco_to_snap.pbs :mkdirp yes
#+BEGIN_SRC sh :var DIR=(file-name-directory buffer-file-name) :var genomes=genome_paths :results output verbatim
  swsetup()
  {
    eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`
  }
  swsetup snap
  swsetup bioperl
  cd $DIR/analysis/annotation/busco
  for file in $(find run* -maxdepth 1 -name 'short_summary*'); do
    BUSCO_PATH=$(dirname $file)
    species=$(sed -e 's/run_//' <<< $BUSCO_PATH)
    GENOME=$(grep $species <<< "$genomes" | awk '{print $2}')
    cd $BUSCO_PATH
    echo $BUSCO_PATH
    echo $species
    echo $GENOME
    mkdir -p snap
    cat augustus_output/gffs/* > $species.combined.gff
    perl /usr/local/igbb/busco_v2/scripts/gff3_to_zff.pl < $species.combined.gff > snap/$species.ann
    cd snap
    grep '^>' $species.ann | tr -d '>' > $species.seqs2keep
    perl /usr/local/igbb/busco_v2/scripts/fasta_sort.pl $species.seqs2keep < $DIR/$GENOME > $species.dna
    fathom $species.ann $species.dna -gene-stats > gene-stats.log 2>&1
    fathom $species.ann $species.dna -validate > validate.log 2>&1
    athom $species.ann $species.dna -categorize 1000 > categorize.log 2>&1
    fathom uni.ann uni.dna -export 1000 -plus > uni-plus.log 2>&1
    mkdir -p params
    cd params
    forge ../export.ann ../export.dna > ../forge.log 2>&1
    cd ..
    hmm-assembler.pl $species params/ > $species.hmm
    cd $DIR/analysis/annotation/busco
  done;
  find $DIR/analysis/annotation/busco/run*/snap -name '*.hmm' | grep -v embryophyta_odb9
#+END_SRC


#+RESULTS:
: run_kirkii
: kirkii
: db/G.kirkii.v1.fasta

** set up maker
#+COMMENT: Split a genome into pieces for annotation by MAKER
#+HEADER: :shebang #!/bin/bash :tangle analysis/annotation/split_genomes/split.sh :mkdirp yes
#+BEGIN_SRC sh :var genomes=genome_paths :var DIR=(file-name-directory buffer-file-name) :results output verbatim
  species=1
  read -a lib < <(sed "${species}q;d" <<< "$genomes")
  GENOME=$DIR/$(dirname ${lib[1]})/${lib[0]}.filtered.fa
  echo $GENOME
  reads_in_filter=$(grep -c '>' $GENOME)
  mkdir -p $DIR/analysis/annotation/split_genomes/${lib[0]}
  cd $DIR/analysis/annotation/split_genomes/${lib[0]}
  /home/maa146/bin/fasta-splitter.pl --n-parts 100 --measure all $GENOME
  num_parts=$(ls -1 $DIR/analysis/annotation/split_genomes/${lib[0]} | wc -l)
  printf "|%s|%s|%d|%d|\n" "${lib[0]}" "${lib[1]}" "$part_size" "$num_parts" >&2
#+END_SRC

#+RESULTS:
: /work/thrash/shane.kokia//analysis/assemble/abyss/kokia/kokia.filtered.fa
: /work/thrash/shane.kokia//analysis/assemble/abyss/kokia/kokia.filtered.fa: 15403 sequences, 518113172 bp => dividing into 100 parts .................................................................................................... OK
: All done, 22 seconds elapsed


#+COMMENT: Set up MAKER for a genome
#+HEADER: :shebang #!/bin/bash
#+BEGIN_SRC sh :var genomes=genome_paths :var DIR=(file-name-directory buffer-file-name)
  swsetup () 
  { 
    eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`
  }
  swsetup maker
  export PERL5LIB=$PERL5LIB:/usr/local/igbb/maker/lib/perl5/  
  while read -a lib; do
    GENOME=$DIR/$(dirname ${lib[1]})/${lib[0]}.filtered.fa
    SNAP_HMM=$DIR/analysis/annotation/busco/run_${lib[0]}/snap/${lib[0]}.hmm
    GENEMARK=$DIR/analysis/annotation/genemark/${lib[0]}/output/gmhmm.mod
    PROTEINS=$DIR/db/uniprot_sprot.fasta
    ESTs=$DIR/analysis/rnaseq_assembly/trinity/${lib[0]}/trinity_out_dir/Trinity.fasta
    AUGUSTUS_CONFIG_PATH=$DIR/analysis/annotation/busco/augustus_setup/config
  
    echo $GENOME
    mkdir -p $DIR/analysis/annotation/maker/${lib[0]}/annotation_parts
    cd $DIR/analysis/annotation/maker/${lib[0]}
    pwd
    maker -CTL
    sed -i -e "s|gmhmm= #GeneMark|gmhmm=$GENEMARK #GeneMark|g" maker_opts.ctl
    sed -i -e "s|gmhmme3= #location|gmhmme3=\/usr\/local\/igbb\/genemark-es-et_4.30\/gmhmme3 #location|g" maker_exe.ctl
    sed -i -e "s|probuild= #location|probuild=\/usr\/local\/igbb\/genemark-es-et_4.30\/probuild #location|g" maker_exe.ctl
    sed -i -e "s|protein=  #protein|protein=$PROTEINS #protein|g" maker_opts.ctl
    sed -i -e "s|augustus_species=|augustus_species=${lib[0]} --AUGUSTUS_CONFIG_PATH=$AUGUSTUS_CONFIG_PATH|g" maker_opts.ctl
    sed -i -e "s|snaphmm= #SNAP|snaphmm=$SNAP_HMM #SNAP|g" maker_opts.ctl
    sed -i -e "s|est= #set|est=$ESTs #set|g" maker_opts.ctl
  done <<< "$genomes";
#+END_SRC

** set up maker 2
#+COMMENT: Set up MAKER for a genome
#+HEADER: :shebang #!/bin/bash
#+BEGIN_SRC sh :var genomes=genome_paths :var DIR=(file-name-directory buffer-file-name)
  swsetup () 
  { 
    eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`
  }
  swsetup maker
  export PERL5LIB=$PERL5LIB:/usr/local/igbb/maker/lib/perl5/  
  while read -a lib; do
    GENOME=$DIR/$(dirname ${lib[1]})/${lib[0]}.filtered.fa
    SNAP_HMM=$DIR/analysis/annotation/maker/${lib[0]}/${lib[0]}.snap.hmm
    GENEMARK=$DIR/analysis/annotation/genemark/${lib[0]}/output/gmhmm.mod
    PROTEINS=$DIR/db/uniprot_sprot.fasta
    ESTs=$DIR/analysis/rnaseq_assembly/trinity/${lib[0]}/trinity_out_dir/Trinity.fasta
    AUGUSTUS_CONFIG_PATH=$DIR/analysis/annotation/maker/${lib[0]}/autoaug/config
  
    echo $GENOME
    mkdir -p $DIR/analysis/annotation/maker_2/${lib[0]}/annotation_parts
    cd $DIR/analysis/annotation/maker_2/${lib[0]}
    pwd
    maker -CTL
    sed -i -e "s|gmhmm= #GeneMark|gmhmm=$GENEMARK #GeneMark|g" maker_opts.ctl
    sed -i -e "s|gmhmme3= #location|gmhmme3=\/usr\/local\/igbb\/genemark-es-et_4.30\/gmhmme3 #location|g" maker_exe.ctl
    sed -i -e "s|probuild= #location|probuild=\/usr\/local\/igbb\/genemark-es-et_4.30\/probuild #location|g" maker_exe.ctl
    sed -i -e "s|protein=  #protein|protein=$PROTEINS #protein|g" maker_opts.ctl
    sed -i -e "s|augustus_species=|augustus_species=${lib[0]} --AUGUSTUS_CONFIG_PATH=$AUGUSTUS_CONFIG_PATH|g" maker_opts.ctl
    sed -i -e "s|snaphmm= #SNAP|snaphmm=$SNAP_HMM #SNAP|g" maker_opts.ctl
    sed -i -e "s|est= #set|est=$ESTs #set|g" maker_opts.ctl
  done <<< "$genomes";
#+END_SRC

#+RESULTS:
| /work/thrash/shane.kokia//analysis/assemble/abyss/kokia/kokia.filtered.fa |
| /work/thrash/shane.kokia/analysis/annotation/maker_2/kokia                |

** AED Graph
#+COMMENT: AED graph for maker annotations
#+HEADER: :tangle analysis/annotation/annotations/aed.R :mkdirp yes
#+BEGIN_SRC R
args = commandArgs(trailingOnly=TRUE)
data <- read.table(args[1])
name <- args[2]
library(ggplot2)
ggplot(data, aes(V1))+stat_ecdf(geom="line")
ggsave(paste(name,".aed.png", sep=""))
#+END_SRC

#+COMMENT: generate AED graphs
#+HEADER: :shebang #!/bin/bash
#+BEGIN_SRC sh :var genomes=genome_paths :var DIR=(file-name-directory buffer-file-name)
  swsetup()
  {
    eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`
  }
  swsetup r-3.2.1
  cd $DIR/analysis/annotation/annotations/
  for file in $(ls -1 *.gff); do
    echo $file
    awk '$2 == "maker"' $file > aed.gff
    sed -e 's/.*_eAED=//' -e 's/;.*//' aed.gff > aed.stats
    Rscript --vanilla aed.R aed.stats ${file%.*}
    #rm aed.gff
    #rm aed.stats
  done;
#+END_SRC

#+RESULTS:
: kokia.gff
